[
    {
        "title": "Introduction",
        "data": [
            "Welcome to HiAll! By using our service, you agree to these Terms and Conditions. Please read them carefully before accessing or using our platform."
        ]
    },
    {
        "title": "Eligibility",
        "data": [
            "You must be at least 18 years old to use HiAll. By creating an account, you represent and warrant that you have the right, authority, and capacity to enter into this agreement and to abide by all of the terms and conditions."
        ]
    },
    {
        "title": "Account Security",
        "data": [
            "You are responsible for maintaining the confidentiality of your login credentials and are fully responsible for all activities that occur under your account."
        ]
    },
    {
        "title": "Group Blind Dating Services",
        "data": [
            "HiAll provides a platform for group blind dating. We do not guarantee the identity or behavior of users and are not responsible for the outcome of any interactions."
        ]
    },
    {
        "title": "Partnered Restaurants",
        "data": [
            "Partnered restaurants manage their availability and services. HiAll is not liable for any disputes or service issues with restaurant partners."
        ]
    },
    {
        "title": "Prohibited Activities",
        "data": [
            "You agree not to use HiAll for any illegal or unauthorized purposes, including harassment, stalking, or impersonating other users."
        ]
    },
    {
        "title": "Termination of Use",
        "data": [
            "HiAll reserves the right to terminate or suspend your account at our discretion for any violation of these terms."
        ]
    },
    {
        "title": "Limitation of Liability",
        "data": [
            "HiAll is not responsible for any indirect, incidental, or consequential damages resulting from your use of the platform."
        ]
    },
    {
        "title": "Privacy",
        "data": [
            "Please review our Privacy Policy to understand how we collect, use, and share your information."
        ]
    },
    {
        "title": "Changes to Terms",
        "data": [
            "We may update these Terms and Conditions periodically. Continued use of HiAll after any updates indicates your acceptance of the revised terms."
        ]
    },
    {
        "title": "Contact Information",
        "data": [
            "If you have any questions about these Terms, please contact us at support@hiall.io"
        ]
    }
]