{
    "status": {
        "status": "ok",
        "message": "Services are running"
    },
    "code-sms": {
        "ES": [
            "AT",
            "ES",
            "FR",
            "IT",
            "PT",
            "FR",
            "DE",
            "NL"
        ],
        "CO": [
            "CO"
        ]
    },
    "privacyPolicy": [
        {
            "title": "Introduction",
            "data": [
                "HiAll values your privacy. This Privacy Policy explains how we collect, use, and protect your information when you use our group blind dating platform."
            ]
        },
        {
            "title": "Information We Collect",
            "data": [
                "We collect personal information you provide when creating an account, such as your name, email address, phone number, and profile details."
            ]
        },
        {
            "title": "How We Use Your Information",
            "data": [
                "We use your information to provide, personalize, and improve our services, facilitate group dating experiences, and communicate with you about updates and promotions."
            ]
        },
        {
            "title": "Sharing Your Information",
            "data": [
                "We may share your information with partnered restaurants for reservation purposes and third-party service providers to enhance the platform’s functionality."
            ]
        },
        {
            "title": "Data Security",
            "data": [
                "We implement appropriate security measures to protect your personal information but cannot guarantee complete security due to potential internet vulnerabilities."
            ]
        },
        {
            "title": "User Responsibilities",
            "data": [
                "You are responsible for keeping your account information secure. Please notify us immediately of any unauthorized use of your account."
            ]
        },
        {
            "title": "Third-Party Links",
            "data": [
                "Our platform may contain links to third-party websites. We are not responsible for the privacy practices of those sites."
            ]
        },
        {
            "title": "Cookies",
            "data": [
                "We use cookies to improve user experience and analyze platform usage. You can manage cookie preferences through your browser settings."
            ]
        },
        {
            "title": "Children’s Privacy",
            "data": [
                "HiAll is not intended for users under the age of 18. We do not knowingly collect information from children."
            ]
        },
        {
            "title": "Policy Updates",
            "data": [
                "We may update this Privacy Policy periodically. Continued use of HiAll after updates constitutes acceptance of the revised policy."
            ]
        },
        {
            "title": "Contact Information",
            "data": [
                "If you have any questions or concerns about this Privacy Policy, please contact us at privacy@hiall.io"
            ]
        }
    ],
    "termsAndConditions": [
        {
            "title": "Introduction",
            "data": [
                "Welcome to HiAll! By using our service, you agree to these Terms and Conditions. Please read them carefully before accessing or using our platform."
            ]
        },
        {
            "title": "Eligibility",
            "data": [
                "You must be at least 18 years old to use HiAll. By creating an account, you represent and warrant that you have the right, authority, and capacity to enter into this agreement and to abide by all of the terms and conditions."
            ]
        },
        {
            "title": "Account Security",
            "data": [
                "You are responsible for maintaining the confidentiality of your login credentials and are fully responsible for all activities that occur under your account."
            ]
        },
        {
            "title": "Group Blind Dating Services",
            "data": [
                "HiAll provides a platform for group blind dating. We do not guarantee the identity or behavior of users and are not responsible for the outcome of any interactions."
            ]
        },
        {
            "title": "Partnered Restaurants",
            "data": [
                "Partnered restaurants manage their availability and services. HiAll is not liable for any disputes or service issues with restaurant partners."
            ]
        },
        {
            "title": "Prohibited Activities",
            "data": [
                "You agree not to use HiAll for any illegal or unauthorized purposes, including harassment, stalking, or impersonating other users."
            ]
        },
        {
            "title": "Termination of Use",
            "data": [
                "HiAll reserves the right to terminate or suspend your account at our discretion for any violation of these terms."
            ]
        },
        {
            "title": "Limitation of Liability",
            "data": [
                "HiAll is not responsible for any indirect, incidental, or consequential damages resulting from your use of the platform."
            ]
        },
        {
            "title": "Privacy",
            "data": [
                "Please review our Privacy Policy to understand how we collect, use, and share your information."
            ]
        },
        {
            "title": "Changes to Terms",
            "data": [
                "We may update these Terms and Conditions periodically. Continued use of HiAll after any updates indicates your acceptance of the revised terms."
            ]
        },
        {
            "title": "Contact Information",
            "data": [
                "If you have any questions about these Terms, please contact us at support@hiall.io"
            ]
        }
    ]
}